In [39]:
import pandas

#### Split-apply-combine

In [4]:
data_url = 'http://bit.ly/2cLzoxH'
gapminder = pandas.read_csv(data_url,as.)
print(gapminder.head())
gapminder.shape

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

(1704, 6)

#### Filter based on the values of column "year"

In [21]:
gapminder_2007 = gapminder[gapminder['year']==2007]
gapminder_2007.head()

        country  year         pop continent  lifeExp     gdpPercap
11  Afghanistan  2007  31889923.0      Asia   43.828    974.580338
23      Albania  2007   3600523.0    Europe   76.423   5937.029526
35      Algeria  2007  33333216.0    Africa   72.301   6223.367465
47       Angola  2007  12420476.0    Africa   42.731   4797.231267
59    Argentina  2007  40301927.0  Americas   75.320  12779.379640

#### Select two variables, "continent" and "lifeExp"

In [31]:
continent_life_2007 = gapminder_2007[['continent','lifeExp']]
continent_life_2007.head()

   continent  lifeExp
11      Asia   43.828
23    Europe   76.423
35    Africa   72.301
47    Africa   42.731
59  Americas   75.320

#### groupby the variable "continent"

In [32]:
grouped = continent_life_2007.groupby('continent')

#### Check the groups

In [33]:
grouped.groups

{'Africa': Int64Index([  35,   47,  131,  167,  203,  215,  239,  263,  275,  323,  335,
              347,  371,  431,  467,  491,  503,  515,  551,  563,  587,  623,
              635,  827,  887,  899,  911,  923,  935,  959,  971,  983, 1031,
             1043, 1067, 1127, 1139, 1271, 1295, 1307, 1331, 1355, 1403, 1415,
             1451, 1463, 1523, 1547, 1571, 1595, 1691, 1703],
            dtype='int64'),
 'Americas': Int64Index([  59,  143,  179,  251,  287,  311,  359,  395,  443,  455,  479,
              611,  647,  659,  791,  995, 1115, 1187, 1199, 1211, 1259, 1559,
             1619, 1631, 1643],
            dtype='int64'),
 'Asia': Int64Index([  11,   95,  107,  227,  299,  671,  707,  719,  731,  743,  767,
              803,  815,  839,  851,  863,  875,  947, 1007, 1055, 1079, 1163,
             1175, 1223, 1319, 1367, 1439, 1499, 1511, 1535, 1655, 1667, 1679],
            dtype='int64'),
 'Europe': Int64Index([  23,   83,  119,  155,  191,  383,  407,  419,  527,  539,  575,
              599,  683,  695,  755,  779, 1019, 1091, 1151, 1235, 1247, 1283,
             1343, 1379, 1391, 1427, 1475, 1487, 1583, 1607],
            dtype='int64'),
 'Oceania': Int64Index([71, 1103], dtype='int64')}

#### get one group from groupby object

In [38]:
grouped.get_group('Americas').head()

    continent  lifeExp
59   Americas   75.320
143  Americas   65.554
179  Americas   72.390
251  Americas   80.653
287  Americas   78.553

#### Compute mean for each group

In [35]:
continent_life_2007.groupby('continent').mean()

             lifeExp
continent
Africa     54.806038
Americas   73.608120
Asia       70.728485
Europe     77.648600
Oceania    80.719500

#### Compute max for each group

In [37]:
continent_life_2007.groupby('continent').max()

           lifeExp
continent
Africa      76.442
Americas    80.653
Asia        82.603
Europe      81.757
Oceania     81.235